# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [175]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

In [176]:
baby_names = pd.read_csv('data/baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [177]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [178]:
baby_names.drop(['Unnamed: 0','Id'], axis=1, inplace=True)
baby_names

         Name  Year Gender State  Count
0        Emma  2004      F    AK     62
1     Madison  2004      F    AK     48
2      Hannah  2004      F    AK     46
3       Grace  2004      F    AK     44
4       Emily  2004      F    AK     41
...       ...   ...    ...   ...    ...
2498    Devin  2004      M    AK     12
2499     Liam  2004      M    AK     12
2500     Paul  2004      M    AK     12
2501  Richard  2004      M    AK     12
2502  Trenton  2004      M    AK     12

[2503 rows x 5 columns]

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [179]:
gender_counts = baby_names.groupby('Gender').count()
if gender_counts['Name']['F']>gender_counts['Name']['M']:
    print('Females are more')
else:
    print('Males are more')

Females are more

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [180]:
baby_names.drop(['Year'], axis=1, inplace=True)

         Name Gender State  Count
0        Emma      F    AK     62
1     Madison      F    AK     48
2      Hannah      F    AK     46
3       Grace      F    AK     44
4       Emily      F    AK     41
...       ...    ...   ...    ...
2498    Devin      M    AK     12
2499     Liam      M    AK     12
2500     Paul      M    AK     12
2501  Richard      M    AK     12
2502  Trenton      M    AK     12

[2503 rows x 4 columns]

In [215]:
names = baby_names.groupby('Name').agg({'Count':['sum', 'count']})
names.columns=names.columns.droplevel()
names.reset_index(inplace=True)
names.rename(columns={'sum':'Total','count':'Occur. Number'}, inplace=True)

        Name  Total  Occur. Number
0    Aaliyah    117             11
1      Aaron     29              1
2       Abby     12              2
3    Abigail    392             11
4        Ada      5              1
..       ...    ...            ...
570    Wyatt     20              1
571   Xander     13              1
572  Zachary     27              1
573      Zoe    159             11
574     Zoey    154             11

[575 rows x 3 columns]

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [217]:
print('Number of different names: ', names['Name'].size)

Number of different names:  575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [221]:
print('Name(s) with max OCCURENCE in data: ', names.loc[names['Occur. Number'].idxmax()]['Name'])
print('Name(s) with max TOTAL NUMBER in data: ', names.loc[names['Total'].idxmax()]['Name'])

Name(s) with max occurence in DATA:  Riley
Name(s) with max TOTAL NUMBER in DATA:  Emma

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [222]:
print('Median name occurence is ',names.sort_values(by=['Occur. Number']).median(axis=0)['Occur. Number'])

Median name occurence is  3.0

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [157]:
baby_names.describe()

             Count
count  2503.000000
mean     11.485018
std       8.830294
min       5.000000
25%       6.000000
50%       8.000000
75%      13.000000
max      65.000000